const str = '按照惯例，通常将状9999按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 f按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称or 。但是，您也可以将其称为 like 或您认为更清楚的其他名称是，您也可以将其称为 like 或您认为更清楚的其他名称9999按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 f按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称or 。但是，您也可以将其称为 like 或您认为更清楚的其他名称是，您也可以将其称为 like 或您认为更清楚的其他名称9999按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 f按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称or 。但是，您也可以将其称为 like 或您认为更清楚的其他名称是，您也可以将其称为 like 或您认为更清楚的其他名称9999按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 f按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称or 。但是，您也可以将其称为 like 或您认为更清楚的其他名称是，您也可以将其称为 like 或您认为更清楚的其他名称9999按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 f按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称or 。但是，您也可以将其称为 like 或您认为更清楚的其他名称是，您也可以将其称为 like 或您认为更清楚的其他名称9999按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 f按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称or 。但是，您也可以将其称为 like 或您认为更清楚的其他名称是，您也可以将其称为 like 或您认为更清楚的其他名称9999按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 f按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称or 。但是，您也可以将其称为 like 或您认为更清楚的其他名称是，您也可以将其称为 like 或您认为更清楚的其他名称9999按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 f按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称or 。但是，您也可以将其称为 like 或您认为更清楚的其他名称是，您也可以将其称为 like 或您认为更清楚的其他名称态变量名称的第一个字母命名为挂起状态参数，例如 for 。但按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 f按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称按照惯例，通常将状态变量名称的第一个字母命名为挂起状态参数，例如 for 。但是，您也可以将其称为 like 或您认为更清楚的其他名称or 。但是，您也可以将其称为 like 或您认为更清楚的其他名称是，您也可以将其称为 like 或您认为更清楚的其他名称'
const originalArray = Array.from({ length: 100000 }, (_, index) => index+str);

let clonedArray;

console.time('slice');
clonedArray = originalArray.slice();
console.log(clonedArray[9999]);
console.timeEnd('slice');

console.time('concat');
clonedArray = originalArray.concat();
console.timeEnd('concat');

console.time('spread');
clonedArray = [...originalArray];
console.timeEnd('spread');

console.time('JSON');
clonedArray = JSON.parse(JSON.stringify(originalArray));
console.timeEnd('JSON');
